/************************************************************
 * 说明：基本绘图类--------网格                                	*                   
 * 参数：canvasEle -------------- 绘图画布ID                 	* 
 *       P ---------------------- 图像绘制范围              	*   
 *       P[0] ------------------- 图像左上角顶点的x坐标 			*      
 *       P[1] ------------------- 图像左上角顶点的y坐标 			*
 *       P[2] ------------------- 图像绘制范围的宽度    			*        
 *       P[3] ------------------- 图像绘制范围的高度   			*   
 ************************************************************/

function DrawGriddingBase(canvasEle,P)
{
	//绘图对象左上角顶点横坐标
	this.objX = P[0];
	//绘图对象左上角顶点纵坐标
	this.objY = P[1];
	//绘图对象宽度
	this.objWidth = P[2];
	//绘图对象高度
	this.objHeight = P[3];
     
	
 


}